---
title: "Common Concepts Comparison"
author: "patrick.unicorn"
date: "Thursday, January 08, 2015"
output: html_document
---

**声明：** 所写均为个人阅读所思所想，限于知识层次和结构，难免有错误遗漏之处，请批判阅读。探讨可循：<mr.geek.ma@foxmail.com>

* * *

## 消息 VS 事件

**消息**是对任何两个事物之间的联系介质的抽象。消息可以是同步也可以是异步的。这里的同步和异步是指消息发送方和消息接收方是否是步调一致，即发送方发送一个消息后等待接收方处理后再继续发送下一个消息。物理世界中，物体和物体之间的引力变化感知可以理解为消息；人文社会中，人与人之间的语言表达可以理解为消息；面向对象设计(OOP)中，调用对象方法也可以理解为向对象发送消息。

**事件**是对事物发生某种状态变化的概念抽象。事件只包含“发生了什么”的信息，并不包含“发生什么之后应该怎样做的”的信息。事件概念中涉及事件源和事件响应方，也可能事件源就是事件响应方。消息可以是事件元数据的传送载体。

简而言之，事件表明“发生什么”，消息表明“发送什么”；事件是因，消息是果。
